podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/IOCON_LPC11Uxx.svd.xml
            <register>
               <name>PIO0_9</name>
               <description>I/O configuration for pin PIO0_9/MOSI0/CT16B0_MAT1</description>
               <addressOffset>0x24</addressOffset>
               <resetValue>0x90</resetValue>
               <fields>
                  <field>
                     <name>FUNC</name>
                     <description>Selects pin function. Values 0x3 to 0x7 are reserved</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>PIO0_9_</name>
                           <description>PIO0_9</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MOSI0_</name>
                           <description>MOSI0</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CT16B0_MAT1_</name>
                           <description>CT16B0_MAT1</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>Selects function mode (on-chip pull-up/pull-down resistor control)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>INACTIVE_NO_PULL_DO</name>
                           <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PULL_DOWN_RESISTOR_E</name>
                           <description>Pull-down resistor enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PULL_UP_RESISTOR_ENA</name>
                           <description>Pull-up resistor enabled</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REPEATER_MODE_</name>
                           <description>Repeater mode</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HYS</name>
                     <description>Hysteresis</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE_</name>
                           <description>Disable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE_</name>
                           <description>Enable</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INV</name>
                     <description>Invert input</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>INPUT_NOT_INVERTED_</name>
                           <description>Input not inverted (HIGH on pin reads as 1, LOW on pin reads as 0)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_INVERTED_HIGH</name>
                           <description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as 1)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OD</name>
                     <description>Open-drain mode</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE_</name>
                           <description>Disable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OPEN_DRAIN_MODE_ENAB</name>
                           <description>Open-drain mode enabled.  This is not a true open-drain mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SWCLK_PIO0_10</name>
               <description>I/O configuration for pin SWCLK/PIO0_10/ SCK0/CT16B0_MAT2</description>
               <addressOffset>0x28</addressOffset>
               <resetValue>0x90</resetValue>
               <fields>
                  <field>
                     <name>FUNC</name>
                     <description>Selects pin function. Values 0x4 to 0x7 are reserved</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SWCLK_</name>
                           <description>SWCLK</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PIO0_10_</name>
                           <description>PIO0_10</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCK0_</name>
                           <description>SCK0</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CT16B0_MAT2_</name>
                           <description>CT16B0_MAT2</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>Selects function mode (on-chip pull-up/pull-down resistor control)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>INACTIVE_NO_PULL_DO</name>
                           <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PULL_DOWN_RESISTOR_E</name>
                           <description>Pull-down resistor enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PULL_UP_RESISTOR_ENA</name>
                           <description>Pull-up resistor enabled</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REPEATER_MODE_</name>
                           <description>Repeater mode</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HYS</name>
                     <description>Hysteresis</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE_</name>
                           <description>Disable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE_</name>
                           <description>Enable</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INV</name>
                     <description>Invert input</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>INPUT_NOT_INVERTED_</name>
                           <description>Input not inverted (HIGH on pin reads as 1, LOW on pin reads as 0)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_INVERTED_HIGH</name>
                           <description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as 1)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OD</name>
                     <description>Open-drain mode</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE_</name>
                           <description>Disable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OPEN_DRAIN_MODE_ENAB</name>
                           <description>Open-drain mode enabled.  This is not a true open-drain mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TDI_PIO0_11</name>
               <description>I/O configuration for pin TDI/PIO0_11/AD0/CT32B0_MAT3</description>
               <addressOffset>0x2C</addressOffset>
               <resetValue>0x90</resetValue>
               <fields>
                  <field>
                     <name>FUNC</name>
                     <description>Selects pin function. Values 0x4 to 0x7 are reserved</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>TDI_</name>
                           <description>TDI</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PIO0_11_</name>
                           <description>PIO0_11</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AD0_</name>
                           <description>AD0</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CT32B0_MAT3_</name>
                           <description>CT32B0_MAT3</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>Selects function mode (on-chip pull-up/pull-down resistor control)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>INACTIVE_NO_PULL_DO</name>
                           <description>Inactive (no pull-down/pull-up resistor enabled)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PULL_DOWN_RESISTOR_E</name>
                           <description>Pull-down resistor enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PULL_UP_RESISTOR_ENA</name>
                           <description>Pull-up resistor enabled</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REPEATER_MODE_</name>
                           <description>Repeater mode</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HYS</name>
                     <description>Hysteresis</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE_</name>
                           <description>Disable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE_</name>
                           <description>Enable</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INV</name>
                     <description>Invert input</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>INPUT_NOT_INVERTED_</name>
                           <description>Input not inverted (HIGH on pin reads as 1, LOW on pin reads as 0)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_INVERTED_HIGH</name>
                           <description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as 1)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADMODE</name>
                     <description>Selects Analog/Digital mode</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ANALOG_INPUT_MODE_</name>
                           <description>Analog input mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIGITAL_FUNCTIONAL_M</name>
                           <description>Digital functional mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FILTR</name>
                     <description>Selects 10 ns input glitch filter</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>FILTER_ENABLED_</name>
                           <description>Filter enabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FILTER_DISABLED_</name>
                           <description>Filter disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OD</name>
                     <description>Open-drain mode</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE_</name>
                           <description>Disable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OPEN_DRAIN_MODE_ENAB</name>
                           <description>Open-drain mode enabled.  This is not a true open-drain mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
